frontend/controllers/DataController.php

SELECT * FROM `region` WHERE region_id in (1,5,37)
SELECT * FROM `message` WHERE `u_id` IS NULL
SELECT * FROM `goods_log` LEFT JOIN `present` ON present.p_id=goods_log.g_id LEFT JOIN `picture` ON picture.p_id=present.p_img_p WHERE `goods_log`.`u_id`=1
---
    public function actionUser(){
        $this->layout="header";
        $session=Yii::$app->session;
        $session->open();
        //判断是否登陆，未登录跳转到登陆页面
        if($session['u_id'] ==''){
            $this->redirect(array('/login/login'));
        }
        //获取登录id
        $id=$session['u_id'];
        //根据查用户信息
        $data=(new \yii\db\Query())
            ->from('message')
            ->where(['u_id' => $id])
            ->one();
        //查询配送地址
        $region=(new \yii\db\Query())
            ->from('region')
            ->where("region_id in (".$data['r_id'].")")
            ->all();
        $str='';
        foreach($region as $k=>$v){
            $str.=$v['region_name'].' ';
        }
        //根据id查兑换商品
        $goods=(new \yii\db\Query())
            ->from('goods_log')
            ->join('LEFT JOIN','present','present.p_id=goods_log.g_id')
            ->join('LEFT JOIN','picture','picture.p_id=present.p_img_p')
            ->where(['goods_log.u_id' => $id])
            ->all();