frontend/controllers/UserController.php

	public function actionIndex()
	{
        $session=Yii::$app->session;
        $session->open();
        //判断是否登陆，未登录跳转到登陆页面
        if($session['u_id'] ==''){
            $this->redirect(array('/login/login'));
        }
        $request=Yii::$app->request;
        //接受修改ID
        $id=$request->get('id');
        //根据ID查对应的数据
        $data=Message::findOne($id);
        //根据r_id查送货地址
        $region=(new \yii\db\Query())
            ->from('region')
            ->where("region_id in (".$data->r_id.")")
            ->all();
        //查询地址三级 给一个数组
        //查询一级
        $arr[]=(new \yii\db\Query())
            ->from('region')
            ->where("parent_id=0")
            ->all();
        //查询二级
        $arr[]=(new \yii\db\Query())
            ->from('region')
            ->where("parent_id=1")
            ->all();
---
SELECT * FROM `message` WHERE `m_id`='1'
SELECT * FROM `region` WHERE parent_id=0
SELECT * FROM `region` WHERE parent_id=1
SELECT * FROM `region` WHERE parent_id=2

    public function actionTui(){
        //开启session
        $session=Yii::$app->session;
        $session->open();
        //判断是否登陆，未登录跳转到登陆页面
        if($session['u_id'] ==''){
            $this->redirect(array('/login/login'));
        }
        //获取session_id，根据ID查我推广的人
        $id=$session['u_id'];
        $query = Extension::find()->where(['extension.u_id' => $id]);
        $pages = new Pagination(['totalCount' => $query->count(),'defaultPageSize'=>1]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->all();
---
SELECT * FROM `extension` WHERE `extension`.`u_id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `extension` WHERE `extension`.`u_id` IS NULL

    public function actionMall(){
        $session=Yii::$app->session;
        $session->open();
        //判断是否登陆，未登录跳转到登陆页面
        if($session['u_id'] ==''){
            $this->redirect(array('/login/login'));
        }
        $data=(new \yii\db\Query())
            ->select(['present.p_id','present.p_name','present.p_name','present.p_jf','picture.p_img'])
            ->from('present')
            ->join('LEFT JOIN','picture','picture.p_id=present.p_img_p')
            ->where("p_num > 0")
            ->limit(6)
            ->all();
---
SELECT `present`.`p_id`, `present`.`p_name`, `present`.`p_name`, `present`.`p_jf`, `picture`.`p_img`, `present`.`p_num`, `present`.`p_content` FROM `present` LEFT JOIN `picture` ON picture.p_id=present.p_img_p WHERE present.p_id=2

    public function actionAuthtoken(){
        $session=Yii::$app->session;
        $session->open();
        //判断是否登陆，未登录跳转到登陆页面
        if($session['u_id'] ==''){
            $this->redirect(array('/login/login'));
        }
        $request=Yii::$app->request;

        if($request->isGet){
            //echo "aa";die;
            //$token=base64_encode(base64_encode('aaa').base64_encode($id.$token));
            $token=$request->get('token');
            $token=str_replace('aaa','',base64_decode(base64_decode($token)));
            //$token=base64_decode($token);
            $token=explode('-',$token);
            //print_r($token)."<br>";
            //echo $session['token'];die;

            if($session['token']==$token[1]){
                unset($session['token']);
                $model=Message::findOne($token[0]);
---
SELECT * FROM `message` WHERE `m_id`=1